Revit 2024 API
Application.DefaultIFCProjectTemplate Property
 Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string DefaultIFCProjectTemplate { get; }
Visual Basic
Public ReadOnly Property DefaultIFCProjectTemplate As String
	Get
Visual C++
public:
property String^ DefaultIFCProjectTemplate {
	String^ get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace